*&---------------------------------------------------------------------*
*& Report ZABA10_04_D01HW_11
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
**********************************************************************
* 31. Объявите константу, содержащую ваше имя.
* 32. Объявите две константы, содержащие значения «X» (истина) и « » (ложь). Примечание. Это обычная практика, поскольку ABAP не содержит логического примитивного типа.
* 33. Объявите константы, содержащие 5 первых десятичных знаков числа Пи.
**********************************************************************

REPORT ZABA10_04_D01HW_11.

CONSTANTS gc04_031 TYPE STRING VALUE 'Leila'.
CONSTANTS gc04_032_1 TYPE C VALUE 'X'.
CONSTANTS gc04_032_2 TYPE C VALUE ' '.
CONSTANTS pi04_1 TYPE p LENGTH 8 DECIMALS 14 VALUE '3.14159265358979'.
CONSTANTS pi04_2 TYPE p LENGTH 7 DECIMALS 5 VALUE '3.14159265358979'.
WRITE:  / 'gc04_031', gc04_031,
        / 'gc04_032_1', gc04_032_1,
        / 'gc04_032_2', gc04_032_2,
        / 'pi04_1', pi04_1,
        / 'pi04_2', pi04_2.

* SOLUTION
* 32. Объявите две константы, содержащие значения «X» (истина) и « » (ложь).
* Примечание. Это обычная практика, поскольку ABAP не содержит логического примитивного типа.

TYPES ty_boolean TYPE c. " what is the length?
CONSTANTS c_true TYPE ty_boolean VALUE 'X'.
CONSTANTS c_false TYPE ty_boolean VALUE space.

* 33. Объявите константы, содержащие 5 первых десятичных знаков числа Пи.
CONSTANTS c_pi TYPE p LENGTH 7 DECIMALS 5 VALUE '3.14159'.
