*&---------------------------------------------------------------------*
*& Report ZABA10_04_D01HW_08
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
**********************************************************************
* 15. Объявите переменную типа character с 10 позициями и присвойте ей «Hello ABAP» в качестве начального значения.
* 16. Объявить переменную числового типа с 4 позициями и начальным значением 1234.
* 17. Объявить переменную типа integer с начальным значением 42.
* 18. Объявить переменную типа integer с начальным значением 12,72.
* 19. Объявите переменную типа date и назначьте ей дату 1 мая.
* 20. Объявите упакованную числовую переменную с 7 знаками после запятой.
* 21. Объявите переменную типа S_CARR_ID.
* 22. Объявите переменную того же типа, что и поле, полученное из таблицы SPFLI.
* 23. Объявить переменную того же типа поля FLDATE таблицы SFLIGHT.
**********************************************************************

REPORT ZABA10_04_D01HW_08.

DATA gv04_t015 TYPE C LENGTH 10.
gv04_t015 = 'Hello ABAP'.
DATA gv04_t016 TYPE N LENGTH 4.
gv04_t016 = 1234.
DATA gv04_t017 TYPE I.
gv04_t017 = 42.
DATA gv04_t018 TYPE F.          " изменила на тип F (вместо Integer)
gv04_t018 = '12.72'.
DATA gv04_t019 TYPE D.
gv04_t019 = '20220105'.         " 1 May ?
DATA gv04_t020 TYPE P DECIMALS 7. " упакованную числовую переменную с 7 знаками после запятой
gv04_t020 = '15.15984'.
DATA gv04_t021 TYPE s_carr_id.
gv04_t021 = 'AA'.
DATA gv04_t022 TYPE spfli-carrid.
gv04_t022 = 'BB'.
DATA gv04_t023 TYPE sflight-fldate.
gv04_t023 = '20223112'.

write:  / 'gv04_t015: ', gv04_t015,
        / 'gv04_t016: ', gv04_t016,
        / 'gv04_t017: ', gv04_t017,
        / 'gv04_t018: ', gv04_t018,
        / 'gv04_t019: ', gv04_t019,
        / 'gv04_t020: ', gv04_t020,
        / 'gv04_t021: ', gv04_t021,
        / 'gv04_t022: ', gv04_t022,
        / 'gv04_t023: ', gv04_t023,
        /.

* SOLUTION
DATA gv04_t0152 TYPE c LENGTH 10 VALUE 'Hello ABAP'.
DATA gv04_t0162 TYPE f VALUE 1234.  " почему F а не N?
DATA gv04_t0172 TYPE i VALUE 42.
DATA gv04_t0182 TYPE i VALUE '12.72'. " как Integer может быть 12.72 округляет до 13
DATA gv04_t0192 TYPE d.
gv04_t0192 = '20131031'.
DATA gv04_t0202 TYPE p LENGTH 10 DECIMALS 7.
gv04_t0202 = '123456789.987654321'.
DATA gv04_t0212 TYPE s_carr_id.
gv04_t0212 = 'AA'.
DATA gv04_t0222 TYPE spfli-carrid.
gv04_t0222 = 'BB'.
DATA gv04_t0232 TYPE sflight-fldate.
gv04_t0232 = '20223112'.

write:  / 'gv04_t0152: ', gv04_t0152,
        / 'gv04_t0162: ', gv04_t0162,
        / 'gv04_t0172: ', gv04_t0172,
        / 'gv04_t0182: ', gv04_t0182,
        / 'gv04_t0192: ', gv04_t0192,
        / 'gv04_t0202: ', gv04_t0202,
        / 'gv04_t0212: ', gv04_t0212,
        / 'gv04_t0222: ', gv04_t0222,
        / 'gv04_t0232: ', gv04_t0232.
