*&---------------------------------------------------------------------*
*& Report ZABA10_04_D01HW_02
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
**********************************************************************
* 100 Заданий
* Задания 1 - 5 Типы данных
**********************************************************************
* 1. Объявите ТИП как символ с 10 позициями.
* 2. Объявить целое число.
* 3. Объявите тип как число с 7 позициями.
* 4. Объявите тип даты.
* 5. Объявите тип времени.
**********************************************************************
* gv - global variable
* sy - глобальная структура Ctrl+Space - найти нужный вариант
* тип F - в программе задаем в одиночных кавычках
* Ctrl + < - закомментировать блок
* Ctrl + > - снять комментарии с блока

REPORT ZABA10_04_D01HW_02.

DATA gv_var_0401 TYPE C LENGTH 10.
DATA gv_var_0402 TYPE I.
DATA gv_var_0403 TYPE N LENGTH 7.
DATA gv_var_0404 TYPE F.
DATA gv_var_0405 TYPE D.
DATA gv_var_0406 TYPE T.

*gv_var_0401 = 'Character!'.   " Character!
*gv_var_0402 = 10011.          "     10.011 - точка просто деление разрядности
*gv_var_0403 = 123456789.      " 3456789 - 7 символов с конца
*gv_var_0404 = '123.456789'.   "   1,2345678900000000E+02
*gv_var_0405 = sy-datum.       " 25102022
*gv_var_0406 = sy-timlo.       " 112523

**********************************************************************
gv_var_0401 = 'Character!'.   " Character!
gv_var_0402 = 5510011.        "  5.510.011 - точка просто деление разрядности
gv_var_0403 = 987654321.      " 7654321 - 7 символов с конца
gv_var_0404 = '123.456789'.   "   1,2345678900000000E+02
gv_var_0405 = sy-datum.       " 25102022
gv_var_0406 = sy-timlo.       " 113014

**********************************************************************

WRITE:  / gv_var_0401,
        / gv_var_0402,
        / gv_var_0403,
        / gv_var_0404,
        / gv_var_0405,
        / gv_var_0406.
