*&---------------------------------------------------------------------*
*& Report ZABA10_04_D01HW_12
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
**********************************************************************
* 34. Объявить рабочую область констант. Все компоненты должны быть целыми числами.
* 35. Объявите рабочую область из 5 постоянных компонентов. Все они должны иметь разные типы примитивов.
**********************************************************************

REPORT ZABA10_04_D01HW_12.

CONSTANTS: BEGIN OF c_integers,
first TYPE i VALUE 1,
second TYPE i VALUE 2,
third TYPE i VALUE 3,
END OF c_integers.


CONSTANTS: BEGIN OF c_primitives,
char TYPE c LENGTH 4 VALUE 'CHAR',
int TYPE i VALUE 101,
date TYPE d VALUE '20141225',
time TYPE t VALUE '112359',
string TYPE string VALUE `STRING`,
END OF c_primitives.
