*&---------------------------------------------------------------------*
*& Report ZABA10_04_D02HW_07
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
**********************************************************************
* 50. Напишите исполняемую программу, содержащую подпрограмму, выводящую все имена пользователей в системе.
* (Проверьте таблицу USR04 и ее содержимое в транзакции SE11, SE16 или SE16N).

**********************************************************************

REPORT ZABA10_04_D02HW_07.

data gtd_04_usr04 TYPE TABLE of usr04.


select * from usr04 into table gtd_04_usr04.

LOOP AT gtd_04_usr04 into DATA(ls_04_line).
  write: / ls_04_line-bname.
ENDLOOP.


  cl_demo_output=>display(
*    EXPORTING
      data    = ls_04_line-bname
*      name    =
*      exclude =
*      include =
  ).
