*&---------------------------------------------------------------------*
*& Report ZABA10_04_D02HW_01
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
**********************************************************************
* 40. Напишите исполняемую программу, выполняющую следующие вычисления: 2 + 3 * 5
**********************************************************************
REPORT zaba10_04_d02hw_01.

DATA gv04_r01 TYPE i.
CONSTANTS gc04_v01 TYPE i VALUE 2.
CONSTANTS gc04_v02 TYPE i VALUE 3.
CONSTANTS gc04_v03 TYPE i VALUE 5.

gv04_r01 = gc04_v01 + gc04_v02 * gc04_v03.

WRITE: 'Задание 40.'.
WRITE: / 'Результат: ', gv04_r01.

**********************************************************************
* 42. Напишите исполняемую программу, которая получает два целых числа внутри параметров
*  и выполняет сложение, вычитание, умножение, деление и степень между ними.
**********************************************************************

DATA gv04_01 TYPE i.
DATA gv04_02 TYPE i.
DATA gv04_03o TYPE c.
DATA gv04_04r TYPE f.


PARAMETERS p04_01 TYPE i.
PARAMETERS p04_02 TYPE i.
PARAMETERS p04_03o TYPE c.



CASE p04_03o.
  WHEN '+'.
    gv04_04r = p04_01 + p04_02.
  WHEN '-'.
    gv04_04r = p04_01 - p04_02.
  WHEN '*'.
    gv04_04r = p04_01 * p04_02.
  WHEN '/'.
    IF p04_02 <> 0.
      gv04_04r = p04_01 / p04_02.
    ELSE.
      WRITE 'Делить на ноль нельзя!' COLOR COL_NEGATIVE.
      EXIT.
    ENDIF.
  WHEN OTHERS.
ENDCASE.

WRITE: /.
WRITE: /'Задание 42.'.
WRITE / |Результат: { p04_01 } { p04_03o } { p04_02 } = { gv04_04r }| COLOR COL_TOTAL.


**********************************************************************
* 42-2. Напишите исполняемую программу, которая получает два целых числа внутри параметров
*  и выполняет сложение, вычитание, умножение, деление и степень между ними.
**********************************************************************


PARAMETERS p042_01 TYPE i.
PARAMETERS p042_02 TYPE i.

IF p042_02 <> 0.
  WRITE: /.
  WRITE: /'Задание 42-2.'.
  WRITE / |Результат: { p042_01 } + { p042_02 } = { p042_01 + p042_02 }| COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } - { p042_02 } = { p042_01 - p042_02 }| COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } * { p042_02 } = { p042_01 * p042_02 }| COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } / { p042_02 } = { p042_01 / p042_02 }| COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } ** { p042_02 } = { p042_01 ** p042_02 }| COLOR COL_TOTAL.
ELSE.
  WRITE: /.
  WRITE: /'Задание 42-2.'.
  WRITE / |Результат: { p042_01 } + { p042_02 } = { p042_01 + p042_02 }| COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } - { p042_02 } = { p042_01 - p042_02 }| COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } * { p042_02 } = { p042_01 * p042_02 }| COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } / { p042_02 } = ' деление на ноль' | COLOR COL_TOTAL.
  WRITE / |Результат: { p042_01 } ** { p042_02 } = { p042_01 ** p042_02 }| COLOR COL_TOTAL.
ENDIF.
